app/controllers/map_controller.rb

SELECT * FROM "region_mappings" WHERE ("region_mappings"."name_asci" = E'Osterreich') LIMIT 1
---
  def show_sequence_type
    # region = Region.find_by_country_code_and_stat_level(params[:country], 0)
    region_results = Strain.find_by_sql ["SELECT country, region, source FROM strains where sequence_type = ?" , params[:sequence_type]] # this sql could potentially return several regions therefore it is an array of Region objects
    @number_of_regions = region_results.size
    @region_counts = Hash.new
    region_results.each do |region_result|
      country = region_result.country
      region = region_result.region
      source = region_result.source
      if @region_counts.has_key?(country)
         if @region_counts[country].has_key?(region)
           if @region_counts[country][region].has_key?(source)
             @region_counts[country][region][source] = @region_counts[country][region][source]+1
           else
             @region_counts[country][region][source] = 1
           end
         else
           @region_counts[country][region] = Hash.new
           @region_counts[country][region][source] = 1
         end
      else
        @region_counts[country] = Hash.new
        @region_counts[country][region] = Hash.new
        @region_counts[country][region][source] = 1
      end
    end
    @region_counts.each_key do |country|
      @region_counts[country].each_key do |region|
        region_mapping = RegionMapping.find(:first, :conditions => ["name_asci like ?", "#{region}%"])